Autodesk.Revit.DB.Mechanical.DuctSettings.SetPressLossCalculationServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
Set the MEPServerInfo of the current pipe pressure loss calculation server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.GetPressLossCalculationServerInfo
Get the MEPServerInfo of the current pipe pressure loss calculation server.
Returns:
The MEPServerInfo of the current pipe pressure loss calculation server
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.IsValidSpecificFittingAngle(System.Double)
Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
angle:
The angle value (in degree).
Returns:
True if the given value is a valid specific fitting angle.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.GetSpecificFittingAngleStatus(System.Double)
Gets the status of given specific angle.
angle:
The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.SetSpecificFittingAngleStatus(System.Double,System.Boolean)
Sets the status of given specific angle.
angle:
The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.
useInLayout:
Status, true - using the given angle during the duct layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can not set an angle status for an invalid angle.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.GetSpecificFittingAngles
Gets the list of specific fitting angles.
Remarks:
Revit will only use the angles specified during the pipe layout or modifying the pipe layout.
When laying out the pipes, if the angle between two pipes is close to the allowed angle,
the specific angle is used for that pipe fitting.
Returns:
Angles (in degrees).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.GetDuctSettings(Autodesk.Revit.DB.Document)
Get the duct settings of the project.
document:
The document.
Returns:
The duct settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.UseAnnotationScaleForSingleLineFittings
Indicates whether use annotation scale for single line fittings or not.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAngleUsage
Determine how to use fitting angle during duct layout or modifying layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RiseDropAnnotationSize
The rise drop annotation size.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAnnotationSize
The value of fitting annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for fittingAnnotationSize must be no more than 30000 feet in absolute value.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.AirViscosity
The air dynamic viscosity.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.AirDensity
The air density.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.Centerline
The abbreviation of the Centerline (=) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.SetDownFromBottom
The abbreviation of the Set Down from bottom (BD) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.DuctSettings.SetUpFromBottom
The abbreviation of the Set Up from bottom (BU) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.DuctSettings.SetDown
The abbreviation of the Set Down from top (TD) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.SetUp
The abbreviation of the Set Up  from top (TU) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnBottom
The abbreviation of the Flat On Bottom (FOB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnTop
The abbreviation of the Flat On Top (FOT) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSuffix
The oval duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSeparator
The oval duct size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.ConnectorSeparator
The duct connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizePrefix
The round duct size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizeSuffix
The round duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSuffix
The rectangular duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSeparator
The rectangular duct size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings
The duct setting class.
Since:
2014